{
  "Header.Item1": "من أنا",
  "Header.Item2": "الخبرات",
  "Header.Item3": "المشاريع",
  "Header.Item4": "التواصل",
  "Header.cvBtn": "السيرة الذاتية",
  "Header.cvName": "CV_Jose_Hernandez_Spanish.pdf",


  "Banner.Pretitle": "مرحباً! اسمي",
  "Banner.name": "سليم الزعبي",
  "Banner.jobTitle": "سليم الزعبي",
  "Banner.Description": "أنا حاصل على شهادتي PMP و Scrum Master مع أكثر من 10 سنوات من الخبرة في تطوير البرمجيات وقيادة الفرق. سجل حافل كمدير تقني وقائد فريق تقني و Scrum Master، متخصص في Java و Angular و Flutter. ماهر في إدارة المشاريع التقنية وقيادة الفرق متعددة الوظائف وتقديم حلول برمجية عالية الجودة.",
  "Banner.ActionBtn": "تواصل معي",
  "Banner.scanPdf": "<span class='underline'>مسح السيرة الذاتية PDF</span>",

  "AboutMe.Title": "عنّي",
  "AboutMe.Paragraphs": [
    "أنا مدير تقني ذو خبرة تزيد عن 10 سنوات في هذا المجال. تشمل شهاداتي PMP و Scrum Master و OCP و OCA، مما يبرز خبرتي في إدارة المشاريع والقيادة التقنية.",
    "تشمل مهاراتي التقنية مجموعة واسعة من المجالات، بما في ذلك تنفيذ الخوادم، وتطوير الواجهة الخلفية والواجهة الأمامية، وتطبيقات الهواتف المحمولة، وإدارة قواعد البيانات. تتيح لي هذه المعرفة الشاملة الإشراف على جميع جوانب المشروع، من تصميم قاعدة البيانات إلى تطوير الواجهة الأمامية وتطبيقات الهواتف المحمولة.",
    "لقد أدرت مشاريع تضم ما يصل إلى 15 عضوًا في الفريق وعدة أصحاب مصلحة، متفوقًا في مهام إدارة المشاريع وتقديم تقارير مفيدة للمديرين وأصحاب المصلحة. تشمل مسؤولياتي أيضًا الإشراف على أداء الفريق، ومراجعة الشيفرات، وتقديم المشورة حول ممارسات الترميز النظيف، وتحسين تنفيذ وبنية قواعد البيانات لأداء أفضل وأمان أعلى وقابلية صيانة.",
    "بالإضافة إلى ذلك، أساهم في تحديد متطلبات الأعمال لمالكي المنتجات، مع ضمان معالجة أي ثغرات لتقديم رؤى قيمة للمستخدمين النهائيين.",
    "بعض المهارات التقنية التي قمت بتدريبها والعمل بها تشمل (لكن لا تقتصر على):"
  ],

  "Experience.Title": "الخبرة",
  "Experience.Jobs": [
    {
      "Tab": "تمكين للتقنية",
      "Title": "مدير تقني",
      "Date": "مايو 2023 - حتى الآن",
      "logo": "tamkeen-logo.svg",
      "height": "50",
      "width": "150",
      "Description": [
        "<span class='underline'>▹ القيادة التقنية ودمج الأنظمة:</span> قاد فريقًا من المطورين المتمرسين في Spring Boot وJava وAngular وFlutter لبناء وتسليم مشروع مساند. شمل ذلك تكاملات مع جهات وطنية رئيسية، مثل وزارة الداخلية ووزارة الموارد البشرية والتنمية الاجتماعية ومركز المعلومات الوطني وstc pay وأنظمة مصرفية متنوعة. ضمن التكامل التشغيل البيني السلس، وتبادل البيانات بشكل آمن، وتعاونًا سلسًا بين المنصات.",

        "<span class='underline'>▹ منهجيات أجايل وتطبيق سكرم:</span> قاد اعتماد منهجيات سكرم لتعزيز التطوير التكراري وتحسين التعاون داخل الفريق. ساهم في تنظيم احتفالات سكرم، بما في ذلك تخطيط السبرينت والاجتماعات اليومية والمراجعات والتقييمات، مما عزز بيئة عمل شفافة ومنتجة. تسارع هذا النهج في التسليم وضمان المرونة في الاستجابة للمتطلبات المتغيرة.",

        "<span class='underline'>▹ حل المشكلات المعقدة وتخفيف المخاطر:</span> توقع التحديات التقنية وحلها بشكل استباقي للحفاظ على زخم المشروع. عمل كحلقة الوصل الأساسية للفريق، معالجًا الأخطاء الرئيسية وحل مشكلات الإنتاج وإزالة العوائق، مما يضمن الحد الأدنى من الانقطاع والتقدم المستمر.",

        "<span class='underline'>▹ الإرشاد وضمان الجودة:</span> قدم إرشادًا مستمرًا لأعضاء الفريق، مما يعزز ثقافة التعلم والابتكار. أجرى مراجعات دورية للشيفرة، فرض الالتزام بممارسات الترميز النظيف، وساعد في عمليات الاختبار الدقيقة لضمان أعلى جودة للتسليمات. حافظ على تركيز قوي على جودة البرمجيات وتحسينها، موفرًا الإرشادات حول تصميم النظام والاستراتيجيات التقنية للنجاح على المدى الطويل.",

        "<span class='underline'>▹ إدارة السبرينت والتسليم الممتاز:</span> أدار عملية السبرينت من البداية إلى النهاية، مما يضمن تحديد الأهداف بوضوح وتحقيقها في كل دورة سبرينت. قاد الفريق لتحقيق معالم المشروع من خلال تنفيذ السبرينت بشكل منضبط وإدارة المهام بعناية. أجرى مراجعات السبرينت والعروض التقديمية، مقدمًا النتائج والتقدم لأصحاب المصلحة، مما يحافظ على توافقهم مع رؤية المشروع.",

        "<span class='underline'>▹ التعاون مع العملاء ومشاركة أصحاب المصلحة:</span> تفاعل مع العملاء طوال دورة حياة المشروع لجمع وتطوير المتطلبات، ومعالجة الملاحظات، وضمان تلبية توقعات العملاء أو تجاوزها. أجرى عروضًا تقديمية دورية وقدم تحديثات شفافة لأصحاب المصلحة، مما يضمن فهمهم الواضح لاتجاه المشروع وتقدمه.",

        "<span class='underline'>▹ التقارير وتتبع الأداء:</span> قدم تقارير دورية ومفصلة للإدارة العليا، موفرًا رؤى حول إنجازات المشروع والمخاطر المحتملة ومجالات التحسين. ضمنت هذه التقارير أن تكون القيادة على اطلاع شامل بحالة المشروع، مما يساعدهم في اتخاذ قرارات مستنيرة والتخطيط استراتيجيًا."
      ]
    },
    {
      "Tab": "علم",
      "Title": "مدير تقني",
      "Date": "أغسطس 2021 - مايو 2023",
      "logo": "elm-logo.svg",
      "height": "50",
      "width": "150",
      "Description": [
        "<span class='underline'>▹ القيادة التقنية وتطوير الواجهة الخلفية:</span> قاد فريق تطوير كامل الواجهة في إنشاء ثلاثة أنظمة خلفية لوزارة الحج والعمرة، باستخدام Spring Boot وJava. شكلت هذه الأنظمة العمود الفقري لعمليات الوزارة الأساسية، داعمةً الوظائف الحيوية لإدارة المتقدمين، والتفاعل مع الشركات، والإشراف التشغيلي.",

        "<span class='underline'>▹ التكامل بين الواجهة الأمامية والخلفية:</span> تعاون بشكل وثيق مع مطوري الواجهة الأمامية لضمان تكامل سلس بين خدمات الواجهة الخلفية والبوابات المعتمدة على Angular التابعة للوزارة. شمل ذلك بوابة الوزارة وبوابة المتقدمين وبوابة الشركات، مما يضمن تطابق منطق الواجهة الخلفية مع تجارب المستخدم في الواجهة الأمامية بشكل مثالي.",

        "<span class='underline'>▹ تطوير وتسليم تطبيقات الهواتف المحمولة:</span> قاد تطوير تطبيق للهواتف المحمولة باستخدام Flutter، موفرًا واجهة مستخدم مرنة ومتوافقة مع الهواتف المحمولة للوصول إلى خدمات وزارة الحج والعمرة. مكن ذلك من تحسين الوصول للمتقدمين وأصحاب المصلحة الذين يتفاعلون مع البوابات عبر الأجهزة المحمولة.",

        "<span class='underline'>▹ سكرم ماستر وتيسير أجايل:</span> تولى دور سكرم ماستر، ميسرًا احتفالات أجايل مثل تخطيط السبرينت والاجتماعات اليومية والتقييمات. ضمن أن يلتزم الفريق بمبادئ أجايل، مما يعزز التطوير التكراري ويعزز بيئة تعاونية وشفافة حيث كانت التحسين المستمر أولوية.",

        "<span class='underline'>▹ إدارة المشروع وتوزيع الموارد:</span> أدار نطاق المشروع والجداول الزمنية والموارد، مما يضمن تسليم المشروع في الوقت المحدد وضمن الميزانية. نسق مع مختلف الإدارات وضمان تنفيذ كل مرحلة من المشروع بكفاءة، مع تلبية جميع المواعيد النهائية وتوقعات أصحاب المصلحة.",

        "<span class='underline'>▹ التعاون مع العملاء وجمع المتطلبات:</span> عمل مباشرة مع وزارة الحج والعمرة لجمع متطلبات مفصلة، وتقديم تحديثات منتظمة حول التقدم، ومعالجة أي ملاحظات أو تغييرات. ضمن أن تظل رضا العميل أولوية قصوى من خلال التواصل المفتوح وفهم واضح لأهداف المشروع.",

        "<span class='underline'>▹ مشاركة أصحاب المصلحة والتقارير:</span> تواصل بانتظام مع المسؤولين في الوزارة وأصحاب المصلحة الرئيسيين لتقديم عروض المشروع وتقارير التقدم والمقاييس الرئيسية، مما يضمن الشفافية ويعزز الثقة خلال دورة حياة المشروع."
      ]
    },
    {
      "Tab": "ياس القابضة - الخطوة الثانية",
      "Title": "قائد تقني وسكرم ماستر",
      "Date": "مايو 2019 - أغسطس 2021",
      "logo": "yas-holding.svg",
      "height": "50",
      "width": "150",
      "Description": [
        "<span class='underline'>▹ القيادة التقنية وتطوير كامل الواجهة:</span> قاد فريق تطوير كامل الواجهة في بناء نظام شامل لوزارة التربية والتعليم الإماراتية. استخدم Java Spring Boot للواجهة الخلفية وAngular للواجهة الأمامية، مما يضمن حلاً قويًا وقابلًا للتوسع يلبي احتياجات النظام التعليمي للوزارة.",

        "<span class='underline'>▹ تطوير تطبيقات الهواتف المحمولة وتجربة المستخدم:</span> نظم تطوير تطبيق للهواتف المحمولة باستخدام Flutter ليكمل النظام المعتمد على الويب. قدم التطبيق تجربة مستخدم سلسة عبر الأجهزة، مما يتيح للمستخدمين الوصول إلى الوظائف الرئيسية أثناء التنقل، مما زاد من الوصول والراحة للطلاب والمعلمين.",

        "<span class='underline'>▹ سكرم ماستر والقيادة الأجايلية:</span> شغل دور سكرم ماستر، مدافعًا عن منهجيات أجايل وميسّرًا الاحتفالات الأجايلية الرئيسية مثل تخطيط السبرينت والاجتماعات اليومية والمراجعات والتقييمات. ضمن أن يلتزم الفريق بمبادئ أجايل، مما يحسن التعاون والإنتاجية من خلال دورات تطوير تكرارية.",

        "<span class='underline'>▹ إدارة المشروع والتسليم في الوقت المحدد:</span> أدار نطاق المشروع بشكل عام والجداول الزمنية وتوزيع الموارد، مما يضمن أن يتم استكمال التسليمات في الوقت المحدد وضمن الميزانية. توازن بشكل فعال بين المعالم الرئيسية للمشروع وتوقعات العملاء، مع الحفاظ على معايير عالية الجودة طوال فترة التطوير.",

        "<span class='underline'>▹ التعاون مع العملاء وجمع المتطلبات:</span> بنى علاقة قوية مع وزارة التربية والتعليم الإماراتية من خلال التعاون النشط مع أصحاب المصلحة لجمع وتطوير المتطلبات. قدم تحديثات منتظمة حول تقدم المشروع، وتناول الملاحظات بسرعة، مما يضمن رضا العميل المستمر وتوافقه مع أهداف المشروع.",

        "<span class='underline'>▹ إتمام المشروع بنجاح:</span> تسليم النظام الشامل لوزارة التربية والتعليم الإماراتية، مع تلبية جميع متطلبات العميل. تم نشر النظام بنجاح، محققًا أهداف المشروع ومساهمًا في التحول الرقمي لخدمات الوزارة التعليمية."
      ]
    },
    {
      "Tab": "بروجرسوفت",
      "Title": "مطور كامل الواجهة",
      "Date": "أكتوبر 2014 - مايو 2019",
      "logo": "progresssoft.svg",
      "height": "50",
      "width": "150",
      "Description": [
        "<span class='underline'>▹ تطوير واجهات خلفية وواجهات مستخدم قوية:</span> ساهم في تطوير أنظمة متعددة باستخدام Java وSpring Boot للواجهة الخلفية وAngular للواجهة الأمامية. عملت هذه الأنظمة على تحسين كفاءة العمليات الداخلية في البنوك والشركات، معززةً الأمان وفعالية المعاملات.",

        "<span class='underline'>▹ تحسين الأداء وصيانة البرمجيات:</span> أجرى عمليات تحسين للأنظمة القائمة، مما زاد من الأداء وسهولة الاستخدام. أدار صيانة البرمجيات وأصلح الأخطاء، مما ضمن تقديم تجربة مستخدم خالية من الأخطاء.",

        "<span class='underline'>▹ التعاون مع فرق متعددة التخصصات:</span> عمل مع فرق مختلفة لضمان التكامل الفعال بين واجهات المستخدم وواجهات البرمجة. حسّن التعاون بين فرق التصميم والتطوير، مما أدى إلى تحسين الحلول النهائية المقدمة للعملاء.",

        "<span class='underline'>▹ دعم العملاء وتقديم حلول مخصصة:</span> تعاون مباشرة مع العملاء لتحديد احتياجاتهم وتقديم حلول مخصصة. عمل على ضمان رضا العملاء من خلال دعم مستمر وتفاعل حقيقي.",

        "<span class='underline'>▹ توثيق العمليات وممارسات الترميز:</span> أعدت وثائق دقيقة لعمليات التطوير والممارسات المثلى، مما ضمنت إمكانية الصيانة والتوسعة المستقبلية. ساهمت هذه الوثائق في إرشاد الأعضاء الجدد في الفريق وضمان استمرارية المعرفة."
      ]
    }
  ],

  "FeatureProjects.Title": "مشاريعي",
  "FeatureProjects.Label": "مشروع مميز",
  "FeatureProjects.Projects": [
    {
      "Title": "مساند",
      "Description": "منصة إلكترونية تهدف إلى توفير نظام شامل لتكامل وتنظيم عملية توظيف العمال من الدول المصدرة، موثقة رقميًا للعقد بين صاحب العمل والعامل وتنظيم العلاقة التعاقدية بين مكاتب التوظيف الخاصة والمكاتب الخاصة الخارجية. مسترشدةً بوزارة الموارد البشرية والتنمية الاجتماعية، تهدف eTawtheeq إلى تسهيل عملية توظيف العمال وحماية الحقوق القانونية للأطراف المرتبطة من خلال تطبيق عملية شاملة تبدأ من عملية التوظيف واختيار مرشح مناسب من قبل صاحب العمل وتنتهي بوصول المرشح إلى المملكة، والذي سيتم توثيقه وتصديقه من خلال عقود موقعة من جميع الأطراف المعنية. كما تهدف eTawtheeq إلى زيادة وعي المستخدمين من خلال محتوى توعوي حول النظام.",
      "imgs": [
        "assets/images/projects/musaned/musaned-1.png",
        "assets/images/projects/musaned/musaned-2.png",
        "assets/images/projects/musaned/musaned-3.png",
        "assets/images/projects/musaned/musaned-4.png",
        "assets/images/projects/musaned/musaned-5.png",
        "assets/images/projects/musaned/musaned-6.png",
        "assets/images/projects/musaned/musaned-7.png",
        "assets/images/projects/musaned/musaned-8.png",
        "assets/images/projects/musaned/musaned-9.png",
        "assets/images/projects/musaned/musaned-10.png",
        "assets/images/projects/musaned/musaned-11.png"
      ],
      "Technologies": ["Microservices", "Springboot", "Angular", "Postgresql", "Java", "Spring Security", "Spring Data (JPA)", "Flutter", "Keycloak", "Kubernetes", "Apache Tomcat", "OAuth2", "JWT"]
    },
    {
      "Title": "مشروع الحج لوزارة الحج والعمرة",
      "Description": "مشروع <b>الحج</b> هو نظام شامل تم تطويره ل <b>وزارة الحج والعمرة</b>، يتكون من ثلاثة بوابات وثلاث تطبيقات موبايل لتبسيط إدارة الحجاج.<br><br>- <b>بوابة الوزارة</b> تتيح للوزارة إدارة الشركات واستيراد بيانات الحجاج من مصادر متعددة، بما في ذلك Excel وCSV، والتكامل في الوقت الفعلي مع <b>منصة نُسك</b>. تحتوي البوابة على خريطة حرارية لتتبع مواقع الحجاج في الوقت الحقيقي، وإدارة الشركات، ونظام تقارير، ولوحة تحكم تعرض رؤى حسب الجنسية، الموقع، العمر، الجنس، وغيرها.<br><br>- <b>بوابة الشركات</b>، متاحة على منصات الويب والموبايل، تمكن الشركات من إدارة مستخدميها وحجاجها، مما يوفر تحكمًا إداريًا سهلًا.<br><br>- <b>بوابة الحاج</b> تشمل تطبيقين موبايل: أحدهما للحجاج، يقدم ميزات مثل مواقع المستشفيات الطارئة، والتواصل بين المجموعات، وتتبع خطوات الحج، وآخر لقادة مجموعات الحجاج لتتبع والتواصل مع أعضاء مجموعتهم في الوقت الحقيقي. تدعم بوابة الويب كل من القادة والحجاج مع وظائف مشابهة.",
      "imgs": [
        "assets/images/projects/hajj/hajj-1.png",
        "assets/images/projects/hajj/hajj-2.png",
        "assets/images/projects/hajj/hajj-3.png",
        "assets/images/projects/hajj/hajj-4.png",
        "assets/images/projects/hajj/hajj-5.png",
        "assets/images/projects/hajj/hajj-6.png"
      ],
      "Technologies": ["Microservices", "Springboot", "Angular", "SQL", "Java", "Spring Security", "Spring Data (JPA)", "Flutter", "Firebase", "Kubernetes", "Apache Kafka", "Apache Tomcat", "OAuth2", "JWT"]
    },
    {
      "Title": "مشروع الحكومة الموريتانية لوزارة الداخلية",
      "Description": "تم تطوير المشروع لوزارة الداخلية في موريتانيا لإدارة الوزارات والإدارات عبر جميع المدن. يتضمن ميزات لإضافة وتحديث الوزارات والإدارات، مع دعم لإدارة مواقعها، شعاراتها، مستخدميها، وجداول العمل/العطلات. كما يتيح النظام للزوار تسجيل الدخول باستخدام أرقام هوياتهم وحجز مواعيد مع الوزارات أو الإدارات. بالإضافة إلى ذلك، يدير إدارة المواعيد ومعالجة المدفوعات للحجوزات التي تتطلب مدفوعات.",
      "imgs": [
        "assets/images/projects/muritania/muritania-1.png",
        "assets/images/projects/muritania/muritania-2.png",
        "assets/images/projects/muritania/muritania-3.png",
        "assets/images/projects/muritania/muritania-4.png",
        "assets/images/projects/muritania/muritania-5.png",
        "assets/images/projects/muritania/muritania-6.png",
        "assets/images/projects/muritania/muritania-7.png",
        "assets/images/projects/muritania/muritania-8.png"
      ],
      "Technologies": ["Microservices", "Springboot", "Angular", "Postgresql", "Java", "Spring Security", "Spring Data (JPA)", "Flutter", "Keycloak", "Kubernetes", "Dockers", "Apache Tomcat", "OAuth2", "JWT"]
    },
    {
      "Title": "المنهل لوزارة التربية والتعليم في الإمارات",
      "Description": "المشروع لوزارة التربية والتعليم في الإمارات هو نظام شامل مصمم لإدارة المدارس، والإدارات، والتفاصيل المالية، والطلاب، والفصول، والامتحانات، والدورات، والاختبارات، والعلامات. كما أنه يدير نتائج الثانوية العامة وينشئ الشهادات باستخدام قوالب Word مخصصة، مع تصديرها إلى PDF. بالإضافة إلى ذلك، يتضمن النظام وحدة تقارير تتيح تصدير البيانات بصيغ وامتدادات ملفات مختلفة، مما يوفر حلاً متكاملاً لاحتياجات إدارة التعليم في الوزارة.",
      "imgs": [
        "/assets/images/projects/manhal/manhal-1.png"
      ],
      "Technologies": ["Java", "Springboot", "SQL", "Jasper Reports", "Angular", "Google Web Toolkit(GWT)"]
    },
    {
      "Title": "مجموعة تسوية الشيكات الإلكترونية (ECC) - البنوك",
      "Description": "تحدث مجموعة تسوية الشيكات الإلكترونية (ECC) ثورة في العملية التقليدية للتعامل مع الشيكات الورقية من خلال تحويلها إلى حل رقمي كامل وآمن وشامل عبر دورة حياة الشيك بأكملها. يقلل هذا النظام بشكل كبير من تكاليف التشغيل والوقت المرتبط بإصدار الشيكات وتسويتها. يدعم نماذج التنفيذ الوطنية، بما في ذلك نماذج موزعة، ومزود خدمة التطبيقات، أو نماذج هجينة، مصممة وفقًا لمشهد الدفع وكفاءة الدولة. يوفر PS-ECC أدوات تجارية ذكية للمسؤولين لمراقبة المعاملات وتحسين أداء النظام. تتيح ميزات التقارير الشاملة تتبعًا وتدقيقًا تفصيليًا من خلال تقارير تحليلية وتقارير نهاية اليوم متنوعة. مع الأمان المتقدم، والتكامل السلس، وقابلية التوسع، وبنية تحتية حديثة مدعومة بالسحابة، يضمن PS-ECC بيئة تسوية آمنة وفعالة للمؤسسات المالية.",
      "imgs": [
        "/assets/images/projects/manhal/manhal-1.png"
      ],
      "Technologies": ["Microservices", "Springboot", "Java", "Spring Security", "Spring Data (JPA)", "Flutter", "Keycloak", "Kubernetes", "Dockers", "Angular", "Android", "Swift", "SQL", "Jasper Reports"]
    },
    {
      "Title": "نظام إدارة التفويضات - البنوك",
      "Description": "نظام إدارة التفويضات (MMS) هو حل مركزي متقدم مصمم للهيئات التنظيمية لأتمتة وتبسيط عمليات إدارة التفويضات، كلها مؤمنة بتوقيع رقمي. يمكّن النظام المستخدمين من إنشاء معاملات الخصم المباشر في الوقت الحقيقي، مما يغطي بدء التفويض، التعديل، الإلغاء، التأجيل، الاستمرار، النقل، الاستعلام، والتحقق من المدفوعات. يتكامل النظام بسلاسة مع أنظمة التسوية الآلية (ACH)، داعمًا ISO 20022 (MX) وأشكال رسائل أخرى. يدير النظام كل من التفويضات الأحادية، التي يمكن إنهاؤها من قبل طرف واحد، والتفويضات الثنائية، التي تتطلب موافقة متبادلة. كما يسهل العلاقات بين المدين والدائن، مما يسمح لهم بإدارة التفويضات وفقًا للقواعد التي وضعتها الهيئة التنظيمية.",
      "imgs": [
        "assets/images/agrourbana/agrourbana1.png",
        "assets/images/agrourbana/agrourbana2.png",
        "assets/images/agrourbana/agrourbana3.png"
      ],
      "Technologies": ["Microservices", "Springboot", "Java", "Spring Security", "Spring Data (JPA)", "Flutter", "Keycloak", "Kubernetes", "Dockers", "Angular", "Android", "Swift", "SQL", "Jasper Reports"]
    }
  ],

  "OtherProjects.Title": "More Projects",
  "OtherProjects.Projects": [
    {
      "Title": "SafeRoute: Student Bus Monitoring System",
      "Description": "Tttttt",
      "imgs": ["assets/images/hands-game.png"],
      "ghLink": "https://github.com/andresjosehr/hands-game",
      "demoLink": "https://projects.andresjosehr.com/hands-game",
      "Technologies": ["Angular", "CSS GRID", "SASS", "Angular animations"]
    }
  ],

  "Contact.Pretitle": "و... ماذا الآن؟",
  "Contact.Title": "أهلاً بك!",
  "Contact.Content": "سأكون سعيدًا لسماع أخبارك إذا كنت ترغب في مناقشة فرص جديدة. اكتب لي، وسأرد عليك في أقرب وقت أرى رسالتك.",
  "Contact.Btn": "اتصل بي"

}
